tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
brew "certifi"
brew "xz"
brew "ansible"
brew "aom"
brew "apr-util"
brew "autoconf"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "certbot"
brew "cfn-lint"
brew "coreutils"
brew "cowsay"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "direnv"
brew "docker-compose"
brew "freetds"
brew "gawk"
brew "gh"
brew "git"
brew "openssl@1.1"
brew "python@3.10"
brew "git-filter-repo"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnupg"
brew "pkg-config"
brew "git-secret"
brew "glib"
brew "hadolint"
brew "jq"
brew "krb5"
brew "libpq"
brew "nkf"
brew "nmap"
brew "php"
brew "tcl-tk"
brew "python@3.8"
brew "qemu"
brew "ruby-build"
brew "tmux"
brew "tree"
brew "wget"
brew "zlib"
cask "aws-vault"
