tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
brew "readline"
brew "sqlite"
brew "ansible"
brew "autoconf"
brew "aws-cdk"
brew "awscli"
brew "azure-cli"
brew "direnv"
brew "docker-compose"
brew "gh"
brew "git"
brew "goenv"
brew "jq"
brew "lastpass-cli"
brew "nkf"
brew "nmap"
brew "nvm"
brew "openssl@3"
brew "php"
brew "pkg-config"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "tmux"
brew "tree"
brew "zlib"
brew "hashicorp/tap/terraform"
